import { AbstractServiceRegex } from './abstract-service-regex';

export class Alnum extends AbstractServiceRegex {

    /**
     * Services.
     */
    protected get serviceDefault(): RegExp {
        return /^[0-9A-Z]+$/i;
    }

    /**
     * Services.
     */
    protected get services(): Map<string, RegExp> {
        return new Map([
            ['ar-AE', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-BH', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-DZ', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-EG', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-IQ', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-JO', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-KW', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-LB', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-LY', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-MA', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-QM', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-QA', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-SA', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-SD', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-SY', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-TN', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-YE', /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['bg-BG', /^[0-9А-Я]+$/i],
            ['cs-CZ', /^[0-9A-ZÁČĎÉĚÍŇÓŘŠŤÚŮÝŽ]+$/i],
            ['da-DK', /^[0-9A-ZÆØÅ]+$/i],
            ['de-DE', /^[0-9A-ZÄÖÜß]+$/i],
            ['el-GR', /^[0-9Α-ω]+$/i],
            ['en-AU', /^[0-9A-Z]+$/i],
            ['en-GB', /^[0-9A-Z]+$/i],
            ['en-HK', /^[0-9A-Z]+$/i],
            ['en-IN', /^[0-9A-Z]+$/i],
            ['en-NZ', /^[0-9A-Z]+$/i],
            ['en-US', /^[0-9A-Z]+$/i],
            ['en-ZA', /^[0-9A-Z]+$/i],
            ['en-ZM', /^[0-9A-Z]+$/i],
            ['es-ES', /^[0-9A-ZÁÉÍÑÓÚÜ]+$/i],
            ['fr-FR', /^[0-9A-ZÀÂÆÇÉÈÊËÏÎÔŒÙÛÜŸ]+$/i],
            ['hu-HU', /^[0-9A-ZÁÉÍÓÖŐÚÜŰ]+$/i],
            ['it-IT', /^[0-9A-ZÀÉÈÌÎÓÒÙ]+$/i],
            ['nb-NO', /^[0-9A-ZÆØÅ]+$/i],
            ['nl-NL', /^[0-9A-ZÁÉËÏÓÖÜÚ]+$/i],
            ['nn-NO', /^[0-9A-ZÆØÅ]+$/i],
            ['pl-PL', /^[0-9A-ZĄĆĘŚŁŃÓŻŹ]+$/i],
            ['pt-BR', /^[0-9A-ZÃÁÀÂÇÉÊÍÕÓÔÚÜ]+$/i],
            ['pt-PT', /^[0-9A-ZÃÁÀÂÇÉÊÍÕÓÔÚÜ]+$/i],
            ['ru-RU', /^[0-9А-ЯЁ]+$/i],
            ['sk-SK', /^[0-9A-ZÁČĎÉÍŇÓŠŤÚÝŽĹŔĽÄÔ]+$/i],
            ['sr-RS@latin', /^[0-9A-ZČĆŽŠĐ]+$/i],
            ['sr-RS', /^[0-9А-ЯЂЈЉЊЋЏ]+$/i],
            ['sv-SE', /^[0-9A-ZÅÄÖ]+$/i],
            ['tr-TR', /^[0-9A-ZÇĞİıÖŞÜ]+$/i],
            ['uk-UA', /^[0-9А-ЩЬЮЯЄIЇҐі]+$/i]
        ]);
    }
}

export default Alnum;
