import { AbstractServiceRegex } from './abstract-service-regex';

export class Alpha extends AbstractServiceRegex {

    /**
     * Services.
     */
    protected get serviceDefault(): RegExp {
        return /^[A-Z]+$/i;
    }

    /**
     * Services.
     */
    protected get services(): Map<string, RegExp> {
        return new Map([
            ['ar-AE', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-BH', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-DZ', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-EG', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-IQ', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-JO', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-KW', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-LB', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-LY', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-MA', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-QM', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-QA', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-SA', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-SD', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-SY', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-TN', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['ar-YE', /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ]+$/],
            ['bg-BG', /^[А-Я]+$/i],
            ['cs-CZ', /^[A-ZÁČĎÉĚÍŇÓŘŠŤÚŮÝŽ]+$/i],
            ['da-DK', /^[A-ZÆØÅ]+$/i],
            ['de-DE', /^[A-ZÄÖÜß]+$/i],
            ['el-GR', /^[Α-ω]+$/i],
            ['en-AU', /^[A-Z]+$/i],
            ['en-GB', /^[A-Z]+$/i],
            ['en-HK', /^[A-Z]+$/i],
            ['en-IN', /^[A-Z]+$/i],
            ['en-NZ', /^[A-Z]+$/i],
            ['en-US', /^[A-Z]+$/i],
            ['en-ZA', /^[A-Z]+$/i],
            ['en-ZM', /^[A-Z]+$/i],
            ['es-ES', /^[A-ZÁÉÍÑÓÚÜ]+$/i],
            ['fr-FR', /^[A-ZÀÂÆÇÉÈÊËÏÎÔŒÙÛÜŸ]+$/i],
            ['hu-HU', /^[A-ZÁÉÍÓÖŐÚÜŰ]+$/i],
            ['it-IT', /^[A-ZÀÉÈÌÎÓÒÙ]+$/i],
            ['nb-NO', /^[A-ZÆØÅ]+$/i],
            ['nl-NL', /^[A-ZÁÉËÏÓÖÜÚ]+$/i],
            ['nn-NO', /^[A-ZÆØÅ]+$/i],
            ['pl-PL', /^[A-ZĄĆĘŚŁŃÓŻŹ]+$/i],
            ['pt-BR', /^[A-ZÃÁÀÂÇÉÊÍÕÓÔÚÜ]+$/i],
            ['pt-PT', /^[A-ZÃÁÀÂÇÉÊÍÕÓÔÚÜ]+$/i],
            ['ru-RU', /^[А-ЯЁ]+$/i],
            ['sk-SK', /^[A-ZÁČĎÉÍŇÓŠŤÚÝŽĹŔĽÄÔ]+$/i],
            ['sr-RS@latin', /^[A-ZČĆŽŠĐ]+$/i],
            ['sr-RS', /^[А-ЯЂЈЉЊЋЏ]+$/i],
            ['sv-SE', /^[A-ZÅÄÖ]+$/i],
            ['tr-TR', /^[A-ZÇĞİıÖŞÜ]+$/i],
            ['uk-UA', /^[А-ЩЬЮЯЄIЇҐі]+$/i]
        ]);
    }
}

export default Alpha;
